n = 5

# введём массивы для коэффициентов
a = [0, -4, -1, 6, 4]      
b = [13, 9, -12, 20, 5]    
c = [-5, -5, -6, -5, 0]    
d = [-66, -47, -43, -74, 14]

# введём переменные для коэффициентов
P = [0] * n
Q = [0] * n

# прямой ход: вычисляем прогоночные коэффициенты P[i], Q[i] для i от 0 до n-1
for i in range(n):
    if i == 0:
        P[i] = -c[i] / b[i]
        Q[i] = d[i] / b[i]
    else:
        P[i] = -c[i] / (b[i] + a[i] * P[i-1])
        Q[i] = (d[i] - a[i] * Q[i-1]) / (b[i] + a[i] * P[i-1])

# обратный ход: вычисляем x[i] от n-1 до 0 (в лекции от n до 1, но в питоне я считаю с 0 элементы)
x = [0] * n # массив x
x[n-1] = int(Q[n-1]) # x5 = 

for i in range(n-2, -1, -1):
    x[i] = int(P[i] * x[i+1] + Q[i])

# Вывод
for i in range(n):
    print(f"x{i+1} = {x[i]}")